"use client"
import { useState } from "react";
import MainImage from "../../../components/MainImg";
import SlidePanel from "../../../components/SlidePanel";

const FoodPage = () => {

    const [currentImgIndex, setCurrentImgIndex] = useState(0);
    const imagesList = [
        "/10.jpg",
        "/11.jpg",
        "/12.jpg",
        "/14.jpg",
        "/15.jpg",
        "/16.jpg",
        "/17.jpg",
        "/18.jpg",
        "/19.jpg",
        "/20.jpg",
        "/21.jpg",
    ]
    return (
        <div className="content">
      
            <MainImage
                imgPath="/6.jpg"
                text="Харчування/Догляд" />


            <SlidePanel title="Харчування">
                <div className="media-text">
                    <h2>Харчування котів: секрети здорового та збалансованого раціону</h2>
                    <p>
                        <img src="\cat20.jpg" />
                        &emsp;Харчування котів має велике значення для їхнього здоров'я та благополуччя.
                        Коти є хижаками, тому їхня дієта повинна містити велику кількість тваринних білків і жирів.
                        Вони не можуть переробляти рослинні білки так само ефективно, як інші тварини, тому їх раціон має бути багатий на м'ясо, птицю та рибу.
                        Правильне харчування забезпечує енергію для активного способу життя, сприяє підтриманню здоров'я шерсті та шкіри, а також підтримує нормальне функціонування внутрішніх органів.
                        <img src="\cat21.jpg" />
                        <br />

                        <br />
                        &emsp;Окрім білків, важливими є також вітаміни та мінерали.
                        Вітаміни А, D, Е і групи B необхідні для підтримки зору, здоров'я шкіри і шерсті, а також для нормального розвитку.
                        Коти також потребують жирних кислот омега-3 і омега-6, які можна отримати з риби чи спеціальних добавок.
                        Правильне співвідношення вуглеводів і клітковини також важливе для здоров'я травної системи.

                        <img src="\cat22.jpg" />
                        &emsp;Збалансоване харчування котів включає не лише м'ясо, а й спеціально розроблені корми, які забезпечують тварину усіма необхідними речовинами.
                        Для котів, які живуть вдома, важливо також стежити за кількістю корму, щоб уникнути зайвої ваги.
                        Надмірна вага може призвести до різних захворювань, тому регулярне контролювання харчування є важливим аспектом догляду за улюбленцем.
                        <img src="\cat23.jpg" />
                        <br />
                    </p>
                </div>
            </SlidePanel>

            <SlidePanel title="Догляд">
                <div className="media-text">
                    <h2>Догляд за котом: як зробити його життя комфортним та здоровим</h2>
                    <p>
                        <img src="\cat24.jpg" />
                        &emsp;Догляд за котом — це не лише годування, а й створення комфортних умов для його життя.
                        Правильний догляд допомагає забезпечити здоров'я, енергію та довголіття вашого улюбленця.
                        Важливою частиною догляду є регулярне чищення шерсті, оскільки коти часто линяють, а також своєчасне оброблення від паразитів.
                        <img src="\cat25.jpg" />
                        <br />

                        <br />
                        &emsp;Коти також потребують чистої води, щоб підтримувати водний баланс і нормальну роботу організму.
                        Для забезпечення чистоти важливо регулярно змінювати лоток і стежити за його гігієною.
                        Також варто звертати увагу на стан зубів і ясен, оскільки захворювання ротової порожнини можуть призвести до серйозних проблем зі здоров'ям.
                        <img src="\cat26.jpg" />
                        &emsp;Купання кота — це не завжди необхідна процедура, оскільки коти самі підтримують чистоту своїми язиками.
                        Однак іноді купання може бути необхідним, якщо кіт забруднився або має проблеми зі шкірою.
                        Важливо пам'ятати, що коти зазвичай не люблять воду, тому купання повинно бути обережним і спокійним.
                        <img src="\cat27.jpg" />
                        <br />
                    </p>
                </div>
            </SlidePanel>


            <div className="slider-middle">
                <div className="sliders">
                    {imagesList.map((image, i) => (
                        <button key={i} onClick={(e) => { setCurrentImgIndex(i) }} />
                    ))}
                </div>
                <div className="slide">
                    {imagesList.map((image, i) => (
                        <img key={i} src={image}
                            style={currentImgIndex == i ? { display: "flex" } : { display: "none" }} />
                    ))}
                </div>

            </div>

        </div>
    );
}
export default FoodPage;