import MainImage from "../../../components/MainImg";
import SlidePanel from "../../../components/SlidePanel";

const Origin = () => {
    return (
        <div className="content" >

            <MainImage
                imgPath="/1.webp"
                text="Походження" />

            <SlidePanel title="Від хижаків до улюбленців: історія котів">
                <div className="media-text">
                    <h2>Як коти стали частиною людського світу: історія їхнього походження</h2>
                    <p>
                        <img src="\cat12.jpg" />
                        &emsp;Коти мають давню і загадкову історію, яка почалася задовго до їхнього знайомства з людиною.
                        Вони походять від спільного предка родини котячих, що жив на Землі мільйони років тому.
                        Еволюція сформувала в них відмінні риси хижаків: гнучке тіло, гострі кігті, чудовий зір і слух.
                        Спочатку коти вели самостійний спосіб життя, полюючи на дрібну здобич у лісах, степах і пустелях.
                        <img src="\cat13.jpg" />
                        <br />
                        &emsp;Перші контакти між котами і людьми, ймовірно, відбулися у період переходу людства до осілого способу життя.
                        Люди почали займатися землеробством і зберігати запаси зерна, що приваблювало гризунів. Коти, які завжди були чудовими мисливцями, почали селитися ближче до поселень, оскільки там вони могли знайти багато їжі.
                        Люди не намагалися одомашнити котів, як це було з собаками, проте поступово між ними встановилися відносини взаємовигоди.
                        <img src="\cat14.jpg" />
                        <br />
                        &emsp;Коти виконували важливу функцію захисту від гризунів, а люди стали толерантніше ставитися до їхньої присутності, часом навіть підгодовуючи їх.
                        Згодом ці тварини перестали боятися людей і почали все частіше залишатися біля людських осель.
                        Їхня незалежність і здатність до самостійного виживання дозволили їм залишатися напівдикими, але водночас вони стали частиною людського середовища.
                        <img src="\cat15.jpg" />
                        <br />
                        &emsp;Культурне значення котів змінювалося з часом. У різні історичні періоди коти сприймалися як символи містики, удачі або навіть нещастя.
                        У стародавньому світі, зокрема в Єгипті, котів шанували як священних тварин і пов’язували їх із богами.
                        У середньовічній Європі, навпаки, вони часто ставали об’єктами забобонів і переслідувань.
                        Незважаючи на це, коти зуміли зберегти свій особливий статус і поширитися по всьому світу.
                        <img src="\cat16.jpg" />
                        <br />
                        &emsp;Сьогодні коти – це не просто домашні улюбленці, а й повноправні члени сімей. Вони мають різноманітні породи, характери й особливості поведінки.
                        Але, незважаючи на всі зміни, вони зберегли свою природну незалежність і граціозність, залишаючись тими самими загадковими створіннями, що колись вирішили оселитися поруч із людьми.
                    </p>
                </div>
            </SlidePanel>

            <div className="media-text">
                <h2>Дикі предки котів</h2>
                <p>
                    <img src="\2.webp" />
                    &emsp;Походження сучасних домашніх котів (Felis catus) бере свій початок від їхніх диких предків. Вчені вважають, що одомашнення котів почалося приблизно 9 000–10 000 років тому на Близькому Сході.
                    Головним предком сучасних муркотунів є дикий лісовий кіт – Felis lybica (африканський дикий кіт).
                    Ці граційні та незалежні тварини мешкали в пустелях Північної Африки та Близького Сходу.
                    <br />
                    &emsp;У дикій природі ці коти були чудовими мисливцями, здатними вистежувати дрібну здобич та пристосовуватися до різних умов.
                    Саме ці риси допомогли їм вижити та привели їх до взаємодії з людьми.

                </p>
            </div>



            <div className="media-text">
                <h2>Коти у Давньому Єгипті</h2>
                <p>
                    <img src="\cat8.jpg" />
                    &emsp;У Давньому Єгипті коти вважалися священними тваринами.
                    Вони асоціювалися з богинею Бастет – покровителькою родини, жіночності та радості.
                    Єгиптяни настільки любили котів, що за їх убивство могли засудити до смерті.
                    <br />
                    &emsp;Коти не тільки допомагали знищувати шкідників, а й вважалися захисниками дому від злих духів.
                    У багатьох гробницях єгипетських фараонів знаходили муміфікованих котів – їх ховали разом із господарями, щоб ті супроводжували їх у потойбічному світі.
                </p>
            </div>

            <div className="media-text">
                <h2>Перші кроки до одомашнення</h2>
                <p>
                    <img src="\cat7.jpg" />
                    &emsp;На початку не люди приручили котів – коти самі вирішили жити поруч із людьми.
                    З появою землеробства та зберігання зерна люди почали стикатися з проблемою гризунів.
                    Коти, будучи природженими мисливцями, почали полювати на мишей та щурів біля людських поселень.
                    <br />
                    &emsp;Люди швидко оцінили користь таких сусідів і стали їх підгодовувати, створюючи сприятливі умови для проживання.
                    Згодом коти почали довіряти людям і поступово ставали домашніми улюбленцями.
                </p>
            </div>



            <div className="media-text">
                <h2>Коти у Стародавньому Римі та Греції</h2>
                <p>
                    <img src="\3.webp" />
                    &emsp;У стародавніх греків і римлян коти також виконували роль мисливців на гризунів.
                    Хоча спочатку в Греції більше цінували тхорів як мишоловів, коти з часом витіснили їх завдяки своїй незалежності та чистоплотності.
                    <br />
                    &emsp;Римляни почали розповсюджувати котів по всій Європі, привозячи їх у нові землі разом із торговими караванами.
                    Так коти стали популярними по всій Європі
                </p>
            </div>




            <div className="media-text">
                <h2>Новий час: коти як члени родини</h2>
                <p>
                    <img src="\cat9.jpg" />
                    &emsp;
                    З XVII–XVIII століття коти поступово повернули собі статус домашніх улюбленців.
                    У вікторіанській Англії котів почали розводити не лише для практичної користі, а й для краси.
                    <br />
                    &emsp; XIX столітті з'явилися перші виставки котів, а в XX столітті – перші офіційні клуби любителів кішок.
                    Почали з’являтися різні породи котів, кожна зі своїми особливостями та унікальним характером.
                </p>
            </div>


            <div className="media-text">
                <h2>Сучасні коти: улюбленці мільйонів</h2>
                <p>
                    <img src="\cat11.jpg" />
                    &emsp;Сьогодні коти – це не просто мисливці на гризунів, а справжні члени сім’ї.
                    Вони стали популярними в усьому світі, а їхні фото та відео підкорюють Інтернет.
                    <br />
                    &emsp;Сучасні дослідження доводять, що коти мають позитивний вплив на психічне здоров’я людей.
                    Їхнє муркотіння допомагає зняти стрес, знижує рівень тривожності та навіть сприяє покращенню серцево-судинного здоров'я.
                </p>
            </div>


        </div>
    );
}
export default Origin;