"use clinet"

import MainImage from "../../../components/MainImg"
import VideoWithDescription from "../../../components/VideoWithDescription"



const SomePage = () => {
    return (
        <div className="content">
        
      
      <MainImage
          imgPath="/nature2.jpg"
          text="Характер" />

            <VideoWithDescription
                title={"Муркотіння – знак задоволення"}
                text={"Муркотіння – один із найприємніших звуків, який може видавати кіт. Найчастіше воно означає, що тварина задоволена та спокійна. Коти муркочуть, коли їх гладять, коли вони вмощуються поруч із господарем або коли отримують улюблені ласощі. Однак муркотіння може бути і способом заспокоїти себе, наприклад, якщо кіт почувається хворим або в стресі. Вважається, що муркотіння має терапевтичний ефект, адже його частота сприяє загоєнню ран і зниженню тривожності як у самих котів, так і в людей."}
                videoSrc={"/video1.mp4"}
            />



            <VideoWithDescription
                title={"Грайливість і мисливський інстинкт"}
                text={"Коти зберегли мисливський інстинкт, навіть якщо вони ніколи не були на вулиці. Вони люблять ганятися за іграшками, бігати за тінями або навіть атакувати ноги господаря, коли той проходить повз. Їхня гра нагадує справжнє полювання – вони можуть довго стежити за 'жертвою', вичікуючи ідеальний момент для атаки. Деякі коти навіть приносять своїм власникам іграшкову 'здобич', ніби демонструючи свої навички. Такі ігри не тільки допомагають підтримувати фізичну активність, а й стимулюють інтелект тварини."}
                videoSrc={"/video2.mp4"}
            />





            <VideoWithDescription
                title={"Прояви агресії"}
                text={"Кіт може стати агресивним, якщо почувається в небезпеці або якщо його щось дратує. Ознаками агресії є притиснуті до голови вуха, розширені зіниці, шипіння та навіть гарчання. Агресія може бути оборонною – коли кіт намагається захистити себе, або ж ігровою – коли він занадто захопився під час гри. Важливо розуміти, що коти рідко нападають без причини, і зазвичай їхня агресія є відповіддю на певний подразник. Якщо кіт став надто агресивним, варто проаналізувати, що могло викликати таку поведінку, і уникати подібних ситуацій у майбутньому."}
                videoSrc={"/video6.mp4"}
            />




            <VideoWithDescription
                title={"Котяча цікавість"}
                text={"Коти дуже цікаві створіння і часто досліджують все навколо. Вони можуть заглядати в пакети, перевіряти відкриті шухляди або навіть забиратися у коробки, щоб зрозуміти, що там знаходиться. Цікавість може бути настільки сильною, що кіт може стрибнути в сумку гостя або спробувати допомогти  розпаковувати посилку. Саме тому котам подобається грати з новими предметами – їм важливо досліджувати світ навколо себе."}
                videoSrc={"/video4.mp4"}
            />




            <VideoWithDescription
                title={"Звичка спати у найзатишніших місцях"}
                text={"Коти можуть заснути будь-де, особливо якщо місце здається їм теплим і комфортним. Вони можуть забиратися у шафи, лягати на ноутбуки, залазити в коробки або навіть спати у раковині. Їхня любов до затишних місць пов'язана з інстинктивною потребою знаходити безпечні місця для відпочинку. Часто господарі помічають, що їхній кіт спить у найдивніших позах, і це ще одна особливість їхнього характеру."}
                videoSrc={"/video5.mp4"}
            />





            <VideoWithDescription
                title={"Спілкування через мову тіла"}
                text={"Коти чудово спілкуються без слів. Їхні вуха, хвіст і очі можуть сказати багато про їхній настрій. Якщо хвіст піднятий вгору – кіт задоволений і дружелюбний. Якщо він тремтить – тварина надзвичайно радіє. Розширені зіниці можуть свідчити про збудження або страх, а повільне моргання – про довіру та любов. Господар, який уважно стежить за поведінкою свого кота, швидко навчиться розуміти його без слів."}
                videoSrc={"/video1.webm"}
            />




        </div>
    )
}

export default SomePage;