"use client";
import { useState } from "react";
import MainImage from "../../components/MainImg";



export default function Home() {

  const [currentImgIndex, setCurrentImgIndex] = useState(0);
  const imagesList = [
    "/cavata.jpg",
    "/4.jpg",
    "/cavata2.jpg"
  ]

  return (
    <div className="content">

      <MainImage
        imgPath="/1.jpg"
        text="Головна"
      />

      <div className="info-block">

        <h1>Що ви знайдете на нашому сайті?</h1>

        <div className="items">
          <div className="item"><button>🐾</button><p>Історію та походження порід – від стародавніх єгипетських кішок до сучасних улюбленців.</p></div>
          <div className="item"><button>🐾</button><p>Догляд та харчування – що потрібно знати, аби ваша киця була здоровою та щасливою.</p></div>
          <div className="item"><button>🐾</button><p>Повадки та характер – розуміння котячої поведінки допоможе вам краще взаємодіяти зі своїм улюбленцем.</p></div>
          <div className="item"><button>🐾</button><p>Цікаві факти – дізнайтеся, чому кішки муркочуть, як вони бачать у темряві та багато іншого.</p></div>
        </div>
      </div>

      <div className="slider-middle">
        <div className="sliders">
          {imagesList.map((image, i) => (
            <button key={i} onClick={(e) => { setCurrentImgIndex(i) }} />
          ))}
        </div>
        <div className="slide">
          {imagesList.map((image, i) => (
            <img key={i} src={image}
              style={currentImgIndex == i ? { display: "flex" } : { display: "none" }} />
          ))}
        </div>

      </div>


      <div className="navigation" />
      <label htmlFor="r1" className="bar"></label>
      <label htmlFor="r2" className="bar"></label>
      <label htmlFor="r3" className="bar"></label>

      <div className="wrapper-info">
        <h1>Кіт - це не просто тварина. Це стан душі.</h1>


        <div className="media-text">
          <h2>Коти – граційні та загадкові створіння</h2>
          <p>
            <img src="\cat1.jpg" />
            &emsp;Коти поєднують у собі м’якість і силу, ніжність і гордість. Вони можуть бути незалежними, але водночас прив’язуються до свого господаря, показуючи свою любов у дрібницях:
            легенькому торканні лапкою, тихому муркотінні або бажанні проводити час поруч. Їхній світ – це світ, де немає метушні, де кожен рух плавний і виважений,
            а кожен погляд сповнений мудрості. Світ котів – це справжня таємниця, наповнена граційністю, розумом і незалежністю.
            <br />
            &emsp;Вони здавна супроводжують людину,
            залишаючись не тільки вірними друзями, а й символами магії, загадковості та навіть божественного початку.
            У Давньому Єгипті їх вважали священними, у середньовіччі – містичними, а сьогодні вони є улюбленцями мільйонів.
            Кожен кіт має свій унікальний характер. Одні обожнюють увагу та постійно шукають контакту з господарем, інші вважають за краще спостерігати за
            світом із високих полиць або спокійно дрімати в затишному куточку.
            <br />
            &emsp;Вони можуть бути грайливими й активними або ж аристократично спокійними,
            але в будь-якому випадку – завжди залишаються вірними друзями своїх власників.Коти володіють особливим чуттям. Вони здатні відчувати настрій людини,
            заспокоювати своїм муркотінням і навіть покращувати самопочуття. Недарма вважається, що кототерапія допомагає зняти стрес, знизити рівень тривожності
            та покращити загальний стан здоров'я.
          </p>
        </div>


        <div className="media-text">
          <h2>Коти – найкращі компаньйони для людини</h2>
          <p>
            <img src="\cat2.jpg" />
            Кажуть, що собака – друг людини, але ті, хто хоча б раз мав кота, знають, що ці створіння можуть бути не менш відданими та люблячими.
            Вони не завжди проявляють свої почуття відкрито, як це роблять собаки, але їхня любов проявляється в дрібницях: коли кіт сідає поруч, коли легенько торкається лапкою або муркоче, створюючи навколо атмосферу спокою й затишку.
            <br />
            &emsp;Коти мають унікальну здатність підлаштовуватися під ритм життя господаря.
            Вони можуть бути активними та грайливими, коли ви в настрої для веселощів, або ж спокійно спати поряд, якщо вам потрібно розслабитися.
            Вони вміють слухати, навіть якщо нічого не відповідають, і завжди залишаються поруч, навіть коли здається, що вони не звертають уваги.
            <br />
            &emsp;
            Якщо ви хочете дізнатися більше про цих чарівних істот, їхні звички, особливості поведінки та секрети догляду – цей сайт для вас! Відкрийте для себе світ котів і дозвольте їм зробити ваше життя ще яскравішим!
          </p>
        </div>



        <div className="media-text">
          <h2> Чому коти – ідеальні домашні улюбленці?</h2>
          <p>
            <img src="\cat3.jpg" />
            Коти – це спокій і гармонія. Їхнє муркотіння має цілющі властивості, а граційні рухи заворожують. Вони незалежні, але завжди поруч. Вони можуть гуляти самі по собі, але в той же час дорожать своїм господарем.   <br />
            &emsp;
            З котами ніколи не буває нудно! Вони вигадують нові ігри, досліджують кожен куточок оселі й навіть можуть навчитися відкривати двері або вимагати їжу на свій розсуд. Вони дарують радість, любов і тепло, стаючи справжніми членами сім’ї.
          </p>
        </div>




        <div className="media-text">
          <h2>Коти – істоти з іншої планети?</h2>
          <p>
            <img src="\cat5.jpg" />
            Коти завжди були загадковими тваринами.
            Вони можуть сидіти годинами, уважно дивлячись у порожнечу, а потім несподівано зірватися з місця і побігти невідомо куди.
            Вони можуть не звертати на вас уваги весь день, а вночі вирішити, що настав час спати у вас на голові.
            Часом здається, що вони знають щось, чого не знаємо ми.   <br />
            &emsp;
            Деякі люди жартома кажуть, що коти — це гості з іншої планети, які прийшли вивчати людство.
            <br />
            &emsp;Інші впевнені, що вони володіють особливою енергією і навіть можуть лікувати своїх господарів.
            Якою б не була правда, одне ми знаємо точно: життя з котом — це завжди пригоди!
          </p>
        </div>


        <div className="media-text">
          <h2>Коти – маленькі терапевти</h2>
          <p>
            <img src="\cat6.jpg" />
            Чи знали ви, що коти можуть покращувати здоров’я?
            Їхнє муркотіння заспокоює, знижує рівень стресу і навіть сприяє швидшому загоєнню ран.   <br />
            &emsp;Кототерапія – це реальна практика, яку використовують у деяких лікарнях і реабілітаційних центрах. Спілкування з котами допомагає людям, які страждають на депресію, безсоння або тривожність.
            Але навіть якщо ви просто втомилися після важкого дня, варто лише погладити кота – і настрій одразу покращується.   <br />
            &emsp;
            Наш сайт присвячений цим неймовірним створінням і їхньому позитивному впливу на людей!
          </p>
        </div>








      </div>






    </div>
  )
}



