import MainImage from "../../../components/MainImg"
import SlidePanel from "../../../components/SlidePanel";
import VideoWithDescription from "../../../components/VideoWithDescription";

const Facts = () => {
    return (
        <div className="content">


            <MainImage
                imgPath="/cat01.jpg"
                text="Факти" />


            <div className="media-text">
                <h2>Коти мають "сонний режим"</h2>
                <p>
                    <img src="/catsleep.jpg" />
                    Коти сплять від 12 до 16 годин на добу, що робить їх одними з найбільш сплячих ссавців. Вони часто сплять, щоб відновити свої енергії для наступних активних періодів, таких як полювання або гра.
                </p>
            </div>

            <div className="media-text">
                <h2>Коти часто використовують "мисливський інстинкт" під час гри</h2>
                <p>
                    <img src="/cat30.jpg" />
                    Навіть домашні коти, які ніколи не були на полюванні, часто проявляють інстинкти, схожі на справжніх хижаків. Вони можуть "полювати" на іграшки, дрібних предметів або навіть на тіні. Цей поведінковий патерн має еволюційне значення — він допомагає котам тренувати свої навички полювання. </p>
            </div>




            <div className="media-text">
                <h2> Коти мають "друге обличчя"</h2>
                <p>
                    <img src="/funnycat.jpg" />
                    Коти можуть змінювати вирази обличчя в залежності від емоцій. Це дозволяє їм сигналізувати про свій настрій через рухи обличчя та очей. Коли вони спокійні або задоволені, їхні очі можуть виглядати розслабленими і навіть піввідкритими. Коти також використовують свої вуса для вираження емоцій.
                </p>
            </div>



            <div className="media-text">
                <h2> Коти можуть встановлювати власні звички і рутини</h2>
                <p>
                    <img src="/cat31.jpg" />
                    Коти дуже прив'язуються до своїх звичок і рутин. Вони можуть навіть засинати в певному місці в певний час, або чекати, поки господар не повернеться з роботи, щоб попрощатися з ним. Ці звички роблять їх більш комфортними в повсякденному житті.
                </p>
            </div>




        </div >
    );

}
export default Facts;

